{
    "images": [
        "https://cdn.cnn.com/cnnnext/dam/assets/190422210943-03-sanders-townhall-0422-super-tease.jpg"
    ],
    "paragraphs": [
        "Here's the bulk of what Sanders said (it's long, but important):",
        "\"At the end of the day, what is most important to me is to see that Donald Trump is not re-elected president, and I intend to do everything I can to make sure that doesn't happen. ",
        "\"But if -- and this is an if -- if for the next year, year-and-a-half, going right into the heart of the election, all that the Congress is talking about is impeaching Trump and Trump, Trump, Trump, and Mueller, Mueller, Mueller, and we're not talking about health care, we're not talking about raising the minimum wage to a living wage, we're not talking about combating climate change, we're not talking about sexism and racism and homophobia, and all of the issues that concern ordinary Americans, what I worry about is that works to Trump's advantage.\"",
        "Sanders went on to say that he supports the House conducting an investigation into some of the seemingly obstructive behaviors by Trump documented by Mueller and that, once that investigation concludes, he was open to reassessing.",
        "That seems to me to be right where Democrats need to be heading into 2020. And here's why:",
        "1) Abandoning the Mueller report conclusions is unacceptable to the party's political base.",
        "2) Impeachment will allow Trump to paint himself as a victim of overly partisan Democrats looking to run him out because they lost an election.",
        "3) Senate Republicans will simply not abandon Trump en masse, ensuring that even if impeachment succeeds in the House, Trump will not be removed from office.",
        "Given those three competing realities, Sanders' position -- we need to continue to investigate but we can't build the entire Democratic case against Trump in 2020 around impeachment -- is the most politically sound place to be.",
        "Although Sanders didn't mention the 2016 campaign or Hillary Clinton's strategy against Trump in that race, it's clear that his position on Trump and impeachment is informed by that contest.",
        "In 2016, Clinton's underlying (and sometimes overlying) message was something like this: Trump is awful and you will never vote for him. And I am the only other person running for president.",
        "Yes, Clinton talked policy, too, but the overarching message was entirely focused on her belief that Trump was unfit for office. And voters agreed! Exit polling from that race showed that just more than a third of all voters liked Trump, thought he was honest and trustworthy or believed he had the temperament to be president. But even some of those who didn't like Trump voted for him anyway because they didn't like Clinton much more -- and, as importantly, they had no sense of what she would do differently.",
        "In short, the 2016 race became a personality contest between two people that voters didn't like. So they chose the one they thought might change things more.",
        "Sanders is clearly wary -- and rightly so -- of re-running that race. To that point, this part of his impeachment answer really hit a chord:",
        "\"If for the next year, year-and-a-half, going right into the heart of the election, all that the Congress is talking about is impeaching Trump and Trump, Trump, Trump, and Mueller, Mueller, Mueller, and we're not talking about health care, we're not talking about raising the minimum wage to a living wage, we're not talking about combating climate change, we're not talking about sexism and racism and homophobia, and all of the issues that concern ordinary Americans, what I worry about is that works to Trump's advantage.\"",
        "That's a correct assessment. Democrats don't need to convince voters that Donald Trump isn't presidential or isn't their cup of tea. Most -- outside of Trump's hardcore supporters -- already believe that. What Democrats need to do is prove to voters that on the issues they care about, Trump's policies are dangerous. Whether that's on his call to repeal the Affordable Care Act or his decision to pull the US out of the Paris Climate Accord or his hardline immigration policies.",
        "What Sanders is arguing is that the way you beat Trump is on policy, not on personality. And that if Democrats spend the next 18 months litigating whether Trump should be impeached for his decidedly unpresidential conduct during the course of the Mueller investigation, they are allowing the race to be about personalities, not policies.",
        "There's reason to believe Sanders is right. In the 2018 midterms, now-Speaker Nancy Pelosi (Calif.) was adamant that Democratic House candidates talk relentlessly about health care and not Trump. The Pelosi mantra was: Focus on what Trump's policies do, rather than who Trump is. And it worked. Health care was by far the top issue for voters according to 2018 exit polling, and that group voted for Democratic candidates by 52 points.",
        "Make no mistake: Sanders knows that by not calling for Trump to be impeached, he is going against the wishes of the most liberal Democrats who comprise his base. His decision to do so suggests that, unlike in his 2016 campaign, Sanders is more focused on winning -- the nomination and the presidency -- than simply proving a point."
    ],
    "description": "Bernie Sanders didn't build his political career on pragmatism. But on Monday night at a CNN-sponsored town hall, he showed that his presidential candidacy will be about more than simply tilting at windmills -- delivering a practical (and nuanced) response to whether his party should push to impeach President Donald Trump in the wake of the release of the Mueller report.",
    "title": "Bernie Sanders just gave the best answer on impeachment - CNNPolitics"
}